Revit 2026 API

# ApplicationNewFamilyDocument Method

---

New family document, including family, titleblock, and annotation symbol

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Document NewFamilyDocument(
	string templateFileName
)
```
```vb
Public Overridable Function NewFamilyDocument (
	templateFileName As String
) As Document
```
```cpp
public:
virtual Document^ NewFamilyDocument(
	String^ templateFileName
)
```
```fsharp
abstract NewFamilyDocument :
        templateFileName : string -> Document
override NewFamilyDocument :
        templateFileName : string -> Document
```

#### Parameters

templateFileName String
    The template file name.

#### Return Value

Document

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'templateFileName' is  or an empty string. |
| InvalidOperationException | If the new family document cannot be created. |

This command corresponds to File->New->Family.../TitleBlock.../Annotation Symbol....

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace